In [1]:
#Adding Matplotlib inline magic command.
%matplotlib inline
#Adding dependencies and setup.
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
#Declaring variables that connect to the CSV files in the Resources folder.
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
#Note1: You read a CSV file into a DATAFrame by pd.reach_csv()

In [5]:
#Reading the city data file and storing into a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [6]:
#Reading the ride data file and storing it into a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [7]:
#Inspecting City Data DataFrame:
#1Get all the rows that contain null values.
#2Make sure the driver_count column has an integer data type.
#3Find out how many data points there are for each type of city.

In [8]:
#Obtaining the colums and rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [9]:
#hmmmm....I thought there were 122 rows though (with headers)! let's check and make sure by running the following:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [10]:
#Great!!! So there are no null values within the city data set!

In [12]:
#Next, we need to see if the driver_count column has a numerical data type because 
#we plan to perform mathematical calculations on that column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [14]:
#Finally, we'll check to see how many data points there are for each type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [15]:
sum(city_data_df["type"]=="Urban")

66

In [16]:
sum(city_data_df["type"]=="Suburban")

36

In [17]:
sum(city_data_df["type"]=="Rural")

18

In [18]:
total_types = sum(city_data_df["type"]=="Urban") + sum(city_data_df["type"]=="Suburban") + sum(city_data_df["type"]=="Rural")
total_types

120

In [19]:
#Inspecting the Ride Data DataFrame
#Get all the rows that contain null values.
#Make sure the fare and ride_id columns are numerical data types.

In [20]:
#NUmber of columns and rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [21]:
#So we see that all columns have the same number of rows and that there are no descrepancies from this part of the inspection.
#Let's make srue that there are zero null vaues in all the columns. 
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [22]:
#Yay!!! No null values in the ride data df!!!

In [23]:
#Next, we need to determine if the fare and ride_id columns are numerical data types so that we can perform mathematical calculations on those columns.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [24]:
#ok, so we see that each column has one data type and that fare and ride id are numerical values! good!

In [29]:
#Now, let's merge!!!
#the common column both data sets have is city. So let's merge based on city columns!
#Therefore, we will merge the two DataFrames on the city column, and then add the city_data_df to the end of the ride_data_df DataFrame with the constraint how="left".
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural